{"doc_id": "2e553cae-ad40-4d3f-ad49-90925472b08b", "text": "﻿Building a Competitive Pokémon TCG Pocket Deck\nPokémon TCG Pocket is a fast‑paced mobile card battler with a streamlined 20‑card deck format. Because every card slot is precious and battles end after 3 Prize Points, effective deck construction requires sharp focus and synergy. This guide covers the fundamentals of competitive deck building in Pocket—plus advanced tactics—without excluding any Pokémon type or play style.\n________________\n\n\n1. Core Rules & Format Essentials\n* 20‑Card Decks – Every deck contains exactly 20 cards, comprising only Pokémon and Trainer cards. Trainers are divided into Supporters, Items and Tools. There are no basic Energy cards in Pocket 🗒️.\n\n* Copy Limit 2 – A maximum of two copies of any card with the same name can be included.\n\n* Prize Points – Players win by earning 3 Prize Points (1 point for knocking out a regular Pokémon, 2 points for a Pokémon ex).\n\n* Bench Size 3 – You may keep up to three Pokémon on the Bench. If all your Pokémon are Knocked Out, you lose immediately.\n\n* Energy Zone – Each turn you gain one free Energy attachment from a shared Energy Zone. Energy does not accumulate if unused.\n\n* Up to 3 Energy Types – A deck may contain Pokémon whose attacks require no more than three different Energy types. Most competitive lists stick to one or two types for consistency.\n\n________________\n\n\n2. Pokémon–Trainer Ratios\nA popular starting ratio is ≈ 8 Pokémon + 12  Trainers. Adjust to suit your strategy:\n   * 5 ≥  Basic Pokémon for stable openings.\n\n   * Focus on 1–2 evolution lines for consistency; avoid cramming several Stage 2 lines into 20 cards.\n\n\n      * A maximum of 8-9 Pokemon per deck is preferred, but the best decks have even less than that. Less Pokémon mean more consistency and a better deck\n\n      * Trainer slots should prioritize draw/search, type‑specific Supporters, and utility Items/Tools.\n\n________________\n\n\n3. Choosing a Main Attacker & Deck Theme\nPick one primary Pokémon (often a Pokémon ex) as your win condition, then build every other card to support that goal. Examples:\nAttack Style\n\tSample Main Pokémon ex\n\tKey Support\n\tAggro (low‑cost, fast KO)\n\tPikachu ex, Buzzwole ex\n\tBench fillers of same type, damage buffs\n\tPowerhouse (build‑up, sweep)\n\tCharizard ex, Gyarados ex\n\tWalls to stall, energy acceleration\n\tCombo/Control\n\tMewtwo ex, Venusaur ex\n\tEnergy engines (e.g., Gardevoir), healing or gust effects\n\tTip: Every supporting Pokémon should serve a clear role—backup attacker, energy accelerator, wall, bench booster, or tech counter. Aim for Pokémon that fulfill multiple roles to maximize each deck slot.\n________________\n\n\n4. Mastering the Energy Zone\n         * Attach every turn—unused Energy is wasted.\n\n         * Streamline types—fewer Energy types mean a higher chance of seeing the one you need.\n\n         * Energy Acceleration—Abilities like Gardevoir’s Psy Shadow or Supporters like Misty provide extra attachments and are crucial for energy‑hungry Pokémon.\n\n         * Plan for Discards/Retreats—discarded Energy leaves the pool for good; use free‑retreat options or Trainer cards that lower retreat cost.\n\n________________\n\n\n5. Staple Trainer Cards\nTrainer Role\n\tExamples\n\tWhy It’s Essential\n\tDraw/Search\n\tProfessor’s Research, Poké Ball, Pokémon Communication\n\tKeeps your hand flowing in a 20‑card deck\n\tType Supporter\n\tMisty (Water), Erika (Grass), Blaine (Fire), etc.\n\tExtra Energy, healing, or damage buffs for one type\n\tDamage Buff / Gust\n\tGiovanni, Sabrina, Cyrus\n\tPush attacks over KO threshold or target weak Bench Pokémon\n\tRetreat/Healing\n\tX Speed, Giant Cape, Potion\n\tMitigate retreat costs and prolong survivability\n\tTools\n\tRocky Helmet, Giant Cape\n\tPunish attackers or raise HP on a tank\n\tAdapt quantities: fast aggro decks favor more draw; evolution decks want extra Pokémon search; bulky strategies may include multiple healing Items.\n________________\n\n\n6. Meta‑Ready Archetype Examples\n            1. Lightning Aggro – Pikachu ex + Zapdos ex, aiming for Turn‑2 KOs. Includes Lt. Surge‑style Supporter for damage boost and maxes out draw/search.\n\n            2. Fire Mid‑Range – Charizard ex backed by Moltres ex and Kangaskhan wall. Uses Blaine for damage and Inferno Dance for energy acceleration.\n\n            3. Psychic Combo – Mewtwo ex + Gardevoir evolution line. Gardevoir fuels extra Psychic Energy each turn; deck packs draw and switch cards.\n\n            4. Grass Stall/Heal – Venusaur ex with Erika, Potions, and Giant Cape. Focuses on longevity, slowly taking prizes while denying KOs.\n\n            5. Fire/Fairy Dual‑Type – Charizard ex + Sylveon ex for matchup flexibility. Requires careful Energy Zone management but covers more threats.\n\n________________\n\n\n7. Testing & Refinement Checklist\n               1. Track Consistency: Do you miss key evolutions or Supporters? Increase draw/search.\n\n               2. Identify Dead Cards: Cut cards that rarely matter in real games.\n\n               3. Cover Weak Matchups: Add tech Pokémon or Trainers that answer decks you lose to.\n\n               4. Follow Expansion Updates: New sets (e.g., Wisdom of Sea & Sky, July 2025) can shift the meta—adapt accordingly.\n\n               5. Iterate Constantly: Even a top‑tier deck list improves with tweaks after each match.\n\n________________\n\n\n8. Common Pitfalls to Avoid\n                  * Over‑stuffing Types: Two Energy decks sounds tempting but usually hurts consistency.\n\n                  * Too Many One‑Off Pokémon: Stick to a compact roster you can reliably draw.\n\n                  * Ignoring Retreat Costs: High‑HP attackers often need help switching—plan for it.\n\n                  * Under‑valuing Trainers: Skimping on Trainers cripples draw power and flexibility.", "metadata": {"doc_type": "guide", "name": "deckbuilding"}}
