{"doc_id": "44a6166d-7724-4e4f-aef0-8a9505fe9e25", "text": "﻿1. Overview\nPokémon TCG Pocket is a streamlined mobile adaptation of the physical Pokémon Trading Card Game. Battles use compact 20‑card decks, automatic Energy generation, and a point‑based win condition, keeping games under five minutes.\n2. Components\n* Deck – Exactly 20 cards (no basic Energy). Maximum two copies of the same card name.\n\n* Energy Zone – A shared pool that produces one Energy automatically each turn.\n\n* Play Area – One Active Pokémon and up to three Benched Pokémon.\n\n* Points Tracker – First player to reach 3 points wins.\n\n3. Deck Construction\n   1. Build a 20‑card list containing only Pokémon and Trainer cards.\n\n\n\n   2. You may include at most two copies of any card sharing the same English name.\n\n   3. Every deck must contain exactly two copies of Professor’s Research.\n\n\n      4. Effects that draw cards (Pokeball, Professors Research, Sylveon EX) are to be considered very positively\n\n\n\n      5. During deck creation you select one or more basic Energy types; the Energy Zone will only ever generate those types.Energy cards do not exist.\n\n\n\n\n\n\n\n\n\n\n4. Game Setup\n         1. Each player shuffles and draws 5 cards. The app guarantees at least one Basic Pokémon (no mulligans).\n         2. Because the hands are randomly drawn, there is no guarantee of opening with the pokemon you want. Being able to adapt and having more than one win condition is crucial.\n\n         3. Both players place a Basic Pokémon Active and up to three on the Bench.\n\n\n\n\n\n5. Turn Structure\nPhase\n\tActions\n\tStart\n\tResolve start‑of‑turn effects. (On the very first turn, the starting player skips their Draw phase.)\n\tDraw\n\tDraw one card.\n\tEnergy Zone Refresh\n\tIf your Zone was empty at the end of last turn, it produces one Energy that remains until used. If any Energy is left unused, no new Energy is generated.\n\tManual Attachment\n\tOnce per turn, move one Energy from your Zone onto a Pokémon (the starting player cannot do this on turn 1).\n\tMain Actions\n\tPlay Basic Pokémon; evolve ; play any number of Item and Pokémon Tool cards; play one Supporter card (total) per turn; retreat your Active Pokémon once per turn; etc.\n\tAttack\n\tAttack with your Active Pokémon if it meets the Energy cost (some attacks cost 0).\n\tPokémon Checkup\n\tResolve Special Conditions and end‑of‑turn effects, then check for Knock Outs.\n\tEnd\n\tPass to the opponent. Unused Energy still in the Zone prevents next turn’s refresh.\n\t6. Victory Conditions\n            * Point System – KO a regular Pokémon: 1 point; KO a Pokémon ex: 2 points. The first player to reach 3 points wins immediately.\n\n            * Turn Limit – Versus battles end after 50 turns, Solo battles after 30 turns; the player with more points wins.\n\n            * Running out of cards does not cause a loss.\n\n\n\n\n\n\n\n\n\n\n\n7. Other key rules\n\n\n               * Weakness adds a flat +20 damage;\n\n               * Maximum hand size is 10; if you would exceed it, choose and discard until you have 10.\n\n               * Confused Pokémon that flip tails no longer damage themselves (the attack simply fails).\n               * Tool cards are played by attaching them to a Benched or Active Pokémon. Once a player attaches a Pokémon Tool to a Pokémon, the Pokémon Tool may only be removed by the effect of a card; removed Pokémon Tools are typically discarded, as are those attached to a Knocked Out Pokémon.\n\n               * Effects that target a random Pokémon are decided by the app.\n\n               * Attack locks (e.g., Buzzwole ex – Big Beat Loop) end as soon as the Pokémon leaves the Active spot.\n\n               * You may play any number of Item and Pokémon Tool cards during your turn, but only one Supporter.\n\n               * Pokémon cannot evolve the same turn they are played. Stage 1 Pokémon evolve from Basic Pokémon, Stage 2 from Stage 1, or directly from Basic when you use a Rare Candy.\n\n               * You may retreat your Active Pokémon only once per turn.\n\n8. Frequently Asked Rulings\n                  * Zero‑Cost Attacks – An attack with no Energy symbols may be used at any time, including the opening turn.\n\n                  * Buzzwole ex – Big Beat Loop – Switching Buzzwole ex to the Bench removes its self‑lock, allowing it to use Big Beat again next turn.\n\n                  * Scizor – Gale Thrust – The +50 bonus applies only if Scizor became Active during your turn before attacking.\n\n\n\n\n\n\n\n\n\n\n\n10. Status Effects (Special Conditions)\nSpecial Conditions represent persistent afflictions that hinder a Pokémon. They are checked during Pokémon Checkup at the end of every player’s turn, always in this order:\nPoison → Burn → Sleep → Paralysis\nA Pokémon can be affected by multiple conditions simultaneously; resolve each separately in the sequence above.\n10.1 Individual Effects\nStatus\n\tIn‑Game Effect\n\tHow to Cure\n\tPoisoned\n\tPut 1 damage counter (10) on the Pokémon at the end of each player’s turn.\n\tEvolve, move to Bench, or attach Lum Berry.\n\tBurned\n\tPut 2 damage counters (20) at the end of each player’s turn, then flip a coin; on Heads, Burn is removed.\n\tSame cures as Poison, plus the coin flip.\n\tSleep\n\tThe Pokémon cannot attack or retreat. At Checkup, flip a coin; on Heads, Sleep is removed.\n\tWake via coin flip, evolve, Bench, or Lum Berry.\n\tParalyzed\n\tThe Pokémon cannot attack or retreat until the end of its controller’s next turn (guaranteed to wear off after one full turn).\n\tWait one turn, evolve, or Lum Berry.\n\tConfused\n\tWhen the Pokémon declares an attack, flip a coin; on Tails, the attack fails (it does not self‑damage in Pocket).\n\tBench, evolve, or Lum Berry.\n\t10.2 Timing & Damage Math\n                     * Because Checkup occurs on both turns, Poison effectively deals 20 damage per round (10 on your turn, 10 on the opponent’s), and Burn deals 40 if not cured by Heads.\n\n                     * Status damage is resolved before the next turn’s Start phase, so it can KO a Pokémon before you regain Energy.\n\n                     * Paralysis has the shortest duration: exactly one full turn cycle.\n\n                     * Sleep can potentially last indefinitely if you keep flipping Tails.\n\n10.3 Universal Cures & Tech Cards\n                        1. Evolve the affected Pokémon (removes all current Special Conditions).\n\n                        2. Switch / Retreat to move it to the Bench. Note: Sleep or Paralysis normally prevent Retreat; use cards like Koga or Switch effects to force a change.\n\n                        3. Lum Berry Pokémon Tool – Instantly removes one Special Condition upon attachment.\n\n                        4. Wait out Paralysis or flip Heads for Sleep/Burn.\n\n10.4 Interaction Notes\n                           * Multiple copies of the same condition do not stack; only one instance is tracked.\n\n                           * A knocked‑out Pokémon still awards points after all status damage is applied.", "metadata": {"doc_type": "guide", "name": "rules"}}
